Repository: 84000/data-translation-memory
Catalog: Toh_147-The_Teaching_on_the_Great_Compassion_of_the_Tathagata-v1.tmx
Source language: bo
Languages: en

source: འདི་དེ་བཞིན་གཤེགས་པ་བྱམས་པ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ལོ་བཅུ་དྲུག་ལོན་ཏེའཁོར་གྱི་ཁྱམས་རིན་པོ་ཆེ་བཀོད་པར་འདུག་ནས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པས་ངེས་པར་འབྱུང་བ། སྒྲིབ་པ་མེད་པའི་སྒོ། འདུས་པ་ཆེན་པོའི་ལེའུའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་ན་བསྟན་པ་དང་ཐམས་ཅད་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་འདུན་པར་བྱ་བ་དང་། མཆོད་པ་འདིས་དེ་བཞིན་གཤེགས་པ་བྱམས་པ་དང་། བསྐལ་པ་བཟང་པོའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་མཆོད་པར་སུ་སྤྲོ།
en: Sixteen years after the Tathāgata Maitreya reaches perfect buddhahood, and while he resides in the pavilion Jeweled Array, when this Dharma discourse of the Great Assembly chapter from The Gateway to Unobstructed Deliverance through the Bodhisattva Way of Life is taught in detail, and a congregation of bodhisattvas endowed with teachings and all qualities assembles, who will delight in making these offerings to the Tathāgata Maitreya as well as to all the tathāgatas of this Good Eon?”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ནས་འདུག་པ་དེ་པད་མའི་སྟན་ལས་ལངས་ཏེ་པུས་མོ་གཡས་པའི་ལྷ་ང་པད་མའི་སྙིང་པོ་ལ་བཙུགས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ།
en: Thereupon, a bodhisattva named Sovereign of the Magical Display of All Phenomena, seated amidst the assembled retinue, rose from his lotus seat, placed his right knee in the heart of the lotus, joined his palms together, and bowed toward the Blessed One.

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་རྒྱན་བཀོད་པ། རྣམ་པར་མ་བརྟགས་པ། མ་འཁྲུགས་པ། མ་རྙིངས་པ། མ་ཉམས་པ་འདིས་དེ་བཞིན་གཤེགས་པ་བྱམས་པ་དང་། དེ་མ་ལགས་པ་བསྐལ་པ་བཟང་པོའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གཞན་ཐམས་ཅད་ལའང་མཆོད་པ་བགྱིད་པར་སྤྲོའོ། །
en: He supplicated the Blessed One and said, “Blessed One, I will delight in offering this array of ornaments, which is not constructed, is not disorderly, does not grow old, and does not deteriorate, to the Tathāgata Maitreya, as well as to all those other tathāgata, arhat, completely and perfectly awakened buddhas of the Good Eon who are not present here.”

source: དེའི་ཚེ་བདུད་རྣམ་པར་འཕྲུལ་པ་ཞེས་བྱ་བ། ཤིན་ཏུ་གནས་པའི་གླིང་བཞི་པ་ན་གནས་པ་འཁོར་དེ་ཉིད་དུ་འདུག་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: At that time, a being called Magical Display of Māra, hailing from the four-continent world system Susthita and seated in that very retinue, asked the bodhisattva Sovereign of the Magical Display of All Phenomena,

source: རིགས་ཀྱི་བུ་སྣོད་གང་གིས་བཀོད་པ་འདི་རྙིངས་པར་གྱུར་གྱི་བར་དུ་འཛིན་པའི་ཁྱོད་ཀྱི་སྣོད་དེ་ཇི་ཙམ་ཞིག །
en: “Son of noble family, how long can any receptacle of yours preserve this array and keep it from getting old?”

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོས་བདུད་རྣམ་པར་འཕྲུལ་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The bodhisattva replied,

source: རིགས་ཀྱི་བུ་སྣོད་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ནི་འཆགས་པར་འགྱུར་བ། བར་དུ་གཅོད་པ་དང་བཅས་པ་དག་གོ། །
en: “Son of noble family, every receptacle is fragile and liable to break.

source: ནམ་མཁའ་ནི་མི་ཤིགས་པ། བར་དུ་གཅོད་པ་མེད་པ་སྟེ་སྣོད་དེ་ཐམས་ཅད་ཀྱི་མཆོག་ཡིན་ནོ། །
en: Only space is indestructible and not liable to break. Therefore, the receptacle of space is the best of all.

source: གྲོགས་པོ་མིག་མ་འཛུམས་པར་ངའི་ལུས་ལ་ལྟོས་ཤིག་དང་། སྣོད་ཆེན་པོ་མཐོང་བར་འགྱུར་རོ། །
en: My friend, look at my body without closing your eyes, and you will see a great receptacle.”

source: དེ་ནས་བདུད་རྣམ་པར་འཕྲུལ་པས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་རྣམ་པར་འཕྲུལ་པའི་ལུས་ལ་མིག་མི་འཛུམས་པར་བལྟས་པ་དང་།
en: Magical Display of Māra gazed at the body of the bodhisattva with his eyes wide open.

source: དེས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་རྣམ་པར་འཕྲུལ་པའི་ལུས་ཀྱི་དཀྱིལ་ལྟེ་བའི་དཀྱིལ་འཁོར་ན་ཆུའི་རྒྱལ་པོར་སྣང་བ་ཞེས་བྱ་བའི་འཇིག་རྟེན་གྱི་ཁམས་མཐོང་ངོ་། །
en: He saw a world sphere called Appearance of the Sovereign of Water in the maṇḍala at the navel center of the bodhisattva’s body and asked,

source: ཅིའི་ཕྱིར་ཆུའི་རྒྱལ་པོར་སྣང་བ་ཞེས་བྱ་ཞེ་ན།
en: “Why is that world sphere called Appearance as the Sovereign of Water?”

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ཆུས་རབ་ཏུ་གང་སྟེ་རྒྱ་མཚོ་གཅིག་པ་ལྟར་སྣང་ངོ་། །
en: “Because it is full of water. It looks just like an ocean.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཨུད་པ་ལའི་དཔལ་ཞེས་བྱ་བ་བཞུགས་སོ། །
en: In that sphere lives a tathāgata known as Glory of Precious Blue Lotus.

source: འཚོའོ། །གཞེས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཉི་ཚེ་ལ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: He dwells there and teaches the Dharma to passing bodhisattvas.

source: ཆུའི་ཕུང་པོ་དེ་ལས་རིན་པོ་ཆེ་བཀོད་པའི་པད་མ་མངོན་པར་འཕགས་ཏེ། དེ་ལ་བཅོམ་ལྡན་འདས་དེ་དང་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་བཞུགས་སོ། །
en: From that vast reservoir of water emerges a lotus with jeweled designs on which are seated a blessed one and bodhisattvas.”

source: དེ་ནས་བདུད་རྣམ་པར་འཕྲུལ་པས་ཐལ་མོ་སྦྱར་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ལ་ཕྱག་འཚལ་ཏོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོས། བདུད་རྣམ་པར་འཕྲུལ་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Magical Display of Māra joined his palms together to salute the bodhisattva, who asked him,

source: གྲོགས་པོ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྣོད་མཐོང་ངམ།
en: “My friend, do you see the receptacle of the bodhisattvas?”

source: སྨྲས་པ་མཐོང་ངོ་། །
en: He replied, “Yes, I see it.

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱིས་སྣོད་འདི་ལྟ་བུ་འདིས་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་རིན་པོ་ཆེ་བཀོད་པ་ཆེན་པོ་མ་སྐམས་པ། མ་རྙིངས་པ་འདི་འཛིན་པར་ནུས་སམ།
en: Noble being, with such a receptacle as this, will you be able to preserve a great jeweled design without it wasting away or getting old for billions of eons?”

source: དེ་ནས་བདུད་རྣམ་པར་འཕྲུལ་པས་བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ཏེཚིག་འདི་སྐད་ཀྱང་སྨྲས་སོ། །
en: At that point, Magical Display of Māra saluted the Blessed One and said,

source: བཅོམ་ལྡན་འདས་བདག་གིས་སྔོན་ཆད་སྐྱེས་བུ་དམ་པ་འདི་ཡང་མ་མཐོང་ངོ་། །
en: “Blessed One, I have never seen this noble person before.

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདིའང་མ་ཐོས་པས་ཅི་བདག་ཉན་ཐོས་ཀྱི་ཐེག་པས་མྱུར་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་བགྱིའམ་སྙམ་པ་ལས།
en: Since I have never heard this Dharma discourse either, I wonder now, how will I pass quickly beyond sorrow by means of the Śrāvaka Vehicle?

source: དེང་བདག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའང་ཐོས། བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་རྣམ་པར་འཕྲུལ་པའི་རྣམ་པར་སྤྲུལ་པའི་བྱིན་གྱི་རླབས་འདི་ཡང་མཐོང་བས་ལྷག་པའི་བསམ་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་བགྱིའོ། །
en: Now that I have heard this discourse and witnessed the miraculous power of the bodhisattva called Magical Display of All Phenomena, I will generate with determination the mind of unsurpassed, complete and perfect awakening.

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་བསྲེགས་ལ། དེའི་འོག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་དུ་ལགས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདི་ལྟ་བུ་ཡོངས་སུ་མི་གཏོང་ངོ་། །
en: Blessed One, even beings who burn in hell for as many eons as there are grains of sand in the river Ganges will eventually awaken to unsurpassed, complete and perfect awakening. Therefore, I will never give up such unsurpassed, complete and perfect awakening!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བདུད་རྣམ་པར་འཕྲུལ་པ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་གནང་སྟེ།
en: The Blessed One replied, “Excellent!

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་གོ་ཆ་བགོས་པ་དང་། རྣམ་པར་སྤྲུལ་པའི་བྱིན་གྱི་རླབས་འདི་ལྟ་བུ་དང་ལྡན་པར་འགྱུར་བ་ལེགས་སོ་ལེགས་སོ། །
en: It is excellent that you, O noble being, now wear the armor of unsurpassed, complete and perfect awakening and possess the blessing of miraculous power.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེང་གེའི་ཏོག་ཅེས་བྱ་བ་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་པ་དེས་བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: At that point a bodhisattva called Siṃhaketu, who was also present in the assembled retinue, said to Dhāraṇīśvara­rāja,

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དག་གཟུངས་གང་ལ་རབ་ཏུ་གནས་ན་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་གསུངས་པ་ཀུན་དུ་འཛིན་པ་དང་། ཆོས་བསྟན་པ་ན་ཟད་པར་མི་འགྱུར་བ་དང་།
en: “Son of noble family, when bodhisattvas are established in dhāraṇīs, they retain all that the buddhas say, and when they teach the Dharma it becomes inexhaustible.

source: ལེགས་པར་བཤད་པས་སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་བྱེད་པར་འགྱུར་བ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཟུངས་གང་ཡིན།
en: Explaining it carefully, they satisfy all beings. What are the bodhisattva dhāraṇīs?”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོས་བྱང་ཆུབ་སེམས་དཔའ་སེང་གེའི་ཏོག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Dhāraṇīśvara­rāja replied,

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་གཟུངས་གང་དག་ལ་རབ་ཏུ་གནས་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་གསུངས་པ་ཀུན་དུ་འཛིན་པ་དང་། ཆོས་བསྟན་པ་ན་ཟད་པར་མི་འགྱུར་བ་དང་།
en: “Son of noble family, when bodhisattvas are established in dhāraṇīs, they retain all that the blessed buddhas say, and when they teach the Dharma it becomes inexhaustible.

source: ལེགས་པར་བཤད་པས་སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་བྱེད་པར་འགྱུར་བ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཟུངས་ནི་བརྒྱད་པོ་འདི་དག་གོ། །
en: Since they explain it carefully, they satisfy all beings.

source: བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: The bodhisattva dhāraṇīs are eight:

source: སྒྲ་དབྱངས་རྣམ་པར་དག་པ་ཞེས་བྱ་བའི་གཟུངས་དང་། མི་ཟད་པའི་ཟ་མ་ཏོག་ཅེས་བྱ་བའི་གཟུངས་དང་། འཁྱིལ་པ་མཐའ་ཡས་པ་ཞེས་བྱ་བའི་གཟུངས་དང་། རྒྱ་མཚོའི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་གཟུངས་དང་། པད་མ་བཀོད་པ་ཞེས་བྱ་བའི་གཟུངས་དང་། ཆགས་པ་མེད་པའི་སྒོར་འཇུག་པ་ཞེས་བྱ་བའི་གཟུངས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམ་པར་ངེས་པ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་གཟུངས་དང་། སངས་རྒྱས་ཀྱི་རྒྱན་བྱིན་གྱིས་བརླབས་པ་ཞེས་བྱ་བའི་གཟུངས་ཏེ།
en: the (1) pure melody dhāraṇī, (2) inexhaustible basket dhāraṇī, (3) limitless enfoldment dhāraṇī, (4) ocean mudrā dhāraṇī, (5) lotus array dhāraṇī, (6) entering the gate of nonattachment dhāraṇī, (7) entering ascertainment by discriminating knowledge dhāraṇī, and (8) blessing of the buddha ornaments dhāraṇī.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཟུངས་ནི་བརྒྱད་པོ་འདི་དག་སྟེ།
en: “Son of noble family, these are the eight bodhisattva dhāraṇīs.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་གཟུངས་འདི་དག་ལ་རབ་ཏུ་གནས་ནས་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་གསུངས་པ་ཀུན་དུ་འཛིན་ཏོ། །
en: Once bodhisattvas are established in these dhāraṇīs, they retain all that the buddhas say,

source: ཆོས་བསྟན་པ་ན་ཟད་པར་མི་འགྱུར་རོ། །
en: and when they teach the Dharma it becomes inexhaustible.

source: ལེགས་པར་བཤད་པས་སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་བྱེད་པར་འགྱུར་རོ། །
en: Since they explain it carefully, they satisfy all beings.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེང་གེའི་ཏོག་གིས་བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Then Siṃhaketu entreated Dhāraṇīśvara­rāja,

source: རིགས་ཀྱི་བུ་ཁྱོད་བྱང་ཆུབ་སེམས་དཔས་གང་ཐོས་པས་གཟུངས་འདི་དག་ཐོབ་པར་བྱ་བའི་ཕྱིར་བརྩོན་པར་འགྱུར་བའི་གཟུངས་འདི་དག་རྒྱ་ཆེར་རྣམ་པར་དབྱེ་བ་ལ་འཇུག་པ་བསྟན་པ་ལ་སྤོབས་པར་གྱིས་ཤིག །
en: “Son of noble family, be eloquent and teach the introduction to the detailed classification of these dhāraṇīs that lead to zeal, in order that the bodhisattvas who hear this introduction will attain these dhāraṇīs.”

source: བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོས་སྨྲས་པ།
en: Dhāraṇīśvara­rāja replied,

source: དེའི་ཕྱིར་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཤིན་ཏུ་ལེགས་པར་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་། གཟུངས་འདི་དག་རྒྱ་ཆེར་རྣམ་པར་དབྱེ་བ་ལ་འཇུག་པ་ཁོ་བོས་ཁྱོད་ལ་བཤད་པར་བྱའོ། །
en: “For that reason, son of noble family, listen carefully and keep in mind the introduction to the detailed classification of these dhāraṇīs that I will now explain to you.

source: རིགས་ཀྱི་བུ་དེ་ལ་སྒྲ་དབྱངས་རྣམ་པར་དག་པའི་གཟུངས་གང་ཞེ་ན།
en: (1) “Son of noble family, you may ask, ‘What is the pure melody dhāraṇī?’

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་འདི་ལ་རབ་ཏུ་གནས་པ་ན་ཆགས་པ་མེད་པ་ལ་འཇུག་པའི་སྒོ་ཤིན་ཏུ་རྣམ་པར་དག་པས་སྙིང་པོ་དང་ལྡན་པའི་བློས་ཤིན་ཏུ་གནས་ཏེ
en: Son of noble family, when established in this bodhisattva dhāraṇī, since it is a completely pure gateway for entering nonattachment, one firmly abides with a mind that is centered.

source: ཆོས་བསྟན་པའི་བྱིན་གྱི་རླབས་ངེས་པར་བྱས་ནས་ཆོས་སྟོན་པ་ན་སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་དབྱངས་ཀྱིས་གོ་བར་བྱེད་དོ། །
en: After one has gained certainty due to the blessings of the Dharma teaching, as one teaches the Dharma the melody of the Dharma generates understanding in a single buddhafield.

source: གཉིས་སམ། གསུམ་མམ། བཞིའམ། ལྔའམ། བཅུའམ། ཉི་ཤུའམ། སུམ་ཅུའམ། བཞི་བཅུའམ། ལྔ་བཅུའམ། བརྒྱ་ཡང་དབྱངས་ཀྱིས་གོ་བར་བྱེད་དོ། །
en: The melody generates understanding in two, three, four, five, ten, twenty, thirty, forty, fifty, or one hundred buddhafields.

source: སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་དབྱངས་ཀྱིས་གོ་བར་བྱེད་པ་ནས་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅུའམ། ཉི་ཤུའམ། སུམ་ཅུའམ། བཞི་བཅུའམ། ལྔ་བཅུའམ། བརྒྱའི་བར་དུ་དབྱངས་ཀྱིས་གོ་བར་བྱེད་དོ། །
en: It generates understanding in one thousand buddhafields, in ten, twenty, thirty, forty, fifty, or up to one hundred thousand buddhafields.

source: སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་མཐའ་ཡས་མུ་མེད་པའི་བར་དག་དབྱངས་ཀྱིས་གོ་བར་བྱེད་དོ། །
en: Its melody creates understanding in billions of buddhafields.

source: དེས་རྒྱང་གྲགས་ཀྱི་ཚད་ཙམ་གྱི་སེང་གེའི་ཁྲི་བྱིན་གྱིས་བརླབས་ཏེ།
en: It magically creates a lion throne that reaches as high as one krośa.

source: དེ་ལ་འདུག་ནས་ཆོས་སྟོན་ཏོ། །
en: One sits down on it and teaches the Dharma.

source: ཇི་ལྟར་མོས་པའི་སེམས་ཅན་རྣམས་མོས་པ་དེ་ལྟ་བུས་ཚིམ་པར་བྱ་བའི་ཕྱིར་དཔག་ཚད་ཕྱེད་ཀྱི་ཚད་ཙམ་མམ། དཔག་ཚད་ཀྱི་ཚད་ཙམ་མམ། རི་རབ་ཀྱི་ཚད་ཙམ་མམ། ཚངས་པའི་འཇིག་རྟེན་གྱི་ཚད་ཙམ་གྱི་སེང་གེའི་ཁྲི་བྱིན་གྱིས་བརླབས་ཏེ།
en: Likewise, in order to satisfy the interests of devoted beings, one magically creates a lion throne that reaches as high as half a yojana, a full yojana, Mount Meru, or the Brahmā realm.

source: དེ་ལྟར་སེང་གེའི་ཁྲི་དེ་ལ་འདུག་པ་ན་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཐམས་ཅད་སྣང་བར་གྱུར་ཏོ། །
en: “While seated on the lion throne, all the buddhas of the ten directions appear.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་ཆོས་གང་བཤད་པ་དེ་ཐམས་ཅད་ཀྱང་ཐོས་སོ། །
en: One hears all the dharmas that the blessed buddhas explain.

source: ཐོས་ནས་ཀྱང་གཟུངས་ཀྱི་སྟོབས་ཀྱིས་ཀུན་དུ་འཛིན་ཏོ། །མི་བརྗེད་དོ། །
en: Having heard them, one retains all of them through the power of dhāraṇī and does not forget them.

source: ཆོས་དེས་ཆོས་ཀྱི་དོན་སོ་སོར་མྱོང་བར་བྱེད་དོ། །
en: Such dharmas cause one to experience the meaning of each of the dharmas.

source: དེ་ཆོས་གཞན་ཉན་པས་ཆོས་སྟོན་པ་ལ་སྒྲིབ་པར་མི་བྱེད་དོ། །
en: Listening to other dharmas does not prevent one from teaching the Dharma.

source: ཆོས་སྟོན་པས་ཆོས་ཉན་པ་ལ་སྒྲིབ་པར་མི་བྱེད་དོ། །
en: Teaching the Dharma does not prevent one from listening to the Dharma.

source: ཡི་གེའི་སྒྲ་གཅིག་ལ་འཇུག་པས་ཡི་གེའི་སྒྲ་ཐམས་ཅད་ལ་འཇུག་པ་སྟོན་ཏོ། །
en: By engaging in the sound of a single syllable, one engages in the sounds of all syllables.

source: ཡི་གེའི་དང་པོ་ཨ་ཞེས་བྱ་བ་བརྗོད་པའི་ཚུལ་གྱིས་ཆོས་ཀྱི་སྒོ་མཐའ་ཡས་པ་བརྗོད་དེ།
en: Thus, by uttering the first letter a, infinite doors to the Dharma are expressed.

source: འདི་ལྟ་སྟེ། འོང་བ་མེད་པའི་མཚན་ཉིད་ཀྱི་ཚུལ་གྱིས་ཆོས་ཐམས་ཅད་ནི་འོང་བ་མེད་པའོ། །འཕོ་བ་མེད་པའི་ཚུལ་གྱིས་ཆོས་ཐམས་ཅད་ནི་སོང་བ་མེད་པའོ། །གནས་མེད་པའི་ཚུལ་གྱིས་ཆོས་ཐམས་ཅད་ནི་གནས་པ་མེད་པའོ། །གཟོད་མ་ནས་རྣམ་པར་དག་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ངོ་བོ་ཉིད་མེད་པའོ། །གཟོད་མ་ནས་མ་སྐྱེས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་རྩ་བ་མེད་པའོ། །གཟོད་མ་ནས་བྱུང་བ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་མཐའ་མ་མེད་པའོ། །རྣམ་པར་འགྲོ་བ་མེད་པའི་ཚུལ་གྱིས་ཆོས་ཐམས་ཅད་ནི་ཟད་པ་མེད་པའོ། །
en: “All phenomena are without coming because they never come, unmoving because they never depart, nonabiding because they are never present, natureless because they are primordially pure, rootless because they are primordially unborn, limitless because they never occur, and without depletion because they are never in motion.

source: མངོན་པར་འདུ་བྱ་བ་མེད་པའི་ཚུལ་གྱིས་ཆོས་ཐམས་ཅད་ནི་མ་སྐྱེས་པའོ། །བྱེད་པ་པོ་མེད་པའི་ཚུལ་གྱིས་ཆོས་ཐམས་ཅད་ནི་སྐྱེ་བ་མེད་པའོ། །རྒྱུ་བ་མེད་པའི་ཚུལ་གྱིས་ཆོས་ཐམས་ཅད་ནི་འབྱུང་བ་མེད་པའོ། །ཕན་ཚུན་ཡང་དག་པར་འདུ་བའི་ཚུལ་གྱིས་ཆོས་ཐམས་ཅད་ནི་མི་འཐུན་པ་མེད་པའོ། །བདག་པོ་མེད་པའི་ཚུལ་གྱིས་ཆོས་ཐམས་ཅད་ནི་མ་འགགས་པའོ། །སྨོན་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་རྒྱུ་བ་མེད་པའོ། །མི་རྟོག་ཅིང་རྣམ་པར་མི་རྟོག་པའི་ཚུལ་གྱིས་ཆོས་ཐམས་ཅད་ནི་སྤྲོས་པ་མེད་པའོ། །ཤིན་ཏུ་སྒྲ་ལ་ཞུགས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་རྗོད་པ་མེད་པའོ། །སྒྲ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་སྨྲ་བ་མེད་པའོ། །རྣམ་པར་གནས་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་བསྟན་དུ་མེད་པའོ། །རྟོག་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་རྣམ་པར་བརྟགས་པ་མ་ཡིན་པའོ། །རྣམ་པར་བསྒྲུབས་པ་མ་ཡིན་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་རློམ་སེམས་མེད་པའོ། །རློམ་སེམས་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་གཡོ་བ་མེད་པའོ། །ནམ་མཁའ་དང་མཉམ་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་རྣམ་པར་ཤེས་པ་མེད་པའོ། །
en: All phenomena are unborn because they are without conditioning, nonarising because they have no creator, without origination because they are unmoving, without discord because they are reciprocally intertwined, unceasing because they are without agency, unmoving because they are wishless, free of elaboration because they are unthinkable and nonconceptual, inexpressible because they have engaged all sound, unutterable because they are soundless, indemonstrable because they do not endure in any form, unconstructed because they are unthinkable, without conceit because they are unestablished, unconceited because they undeceiving, and imperceptible because they are equal to space.

source: ཚིག་གི་ལམ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཐ་སྙད་མེད་པའོ། །ཡུལ་ན་མི་གནས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་གནས་མེད་པའོ། །ཕྱོགས་ན་མི་གནས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་སྐྱེ་བ་མེད་པའོ། །ཉོན་མོངས་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་གཟོད་མ་ནས་རྣམ་པར་དག་པའོ། །བདག་གི་རང་བཞིན་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་བདག་མེད་པའོ། །གཟོད་མ་ནས་རྣམ་པར་དག་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་སེམས་ཅན་མེད་པའོ། །དབང་པོ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་སྲོག་མེད་པའོ། །དོན་དང་བྲལ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་གང་ཟག་མེད་པའོ། །ནང་ཉེ་བར་ཞི་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་གཟོད་མ་ནས་སྟོང་པའོ། །
en: “All phenomena are beyond conventional terms because they have no means of expression, without arising because they do not abide in any object, unborn because they do not abide in any place, primordially pure because they lack afflictive emotions, without self because they lack a nature of their own, without sentient beings because they are primordially pure, without life because of the absence of faculties, without individuality because they are aimless, and primordially empty because of inner peace.

source: མཐའ་མེད་པར་གྱུར་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་མཚན་མ་མེད་པའོ། །ཉེ་བར་ལེན་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་སྨོན་པ་མེད་པའོ། །འདུས་བྱས་མ་ཡིན་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་མངོན་པར་འདུ་བྱེད་པ་མེད་པའོ། །གནས་མེད་པ་དང་། གནས་ལས་ཤིན་ཏུ་འདས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་འདུས་མ་བྱས་པའོ། །གཞན་གྱི་དྲིང་མི་འཇོག་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཐུན་མོང་མ་ཡིན་པའོ། །ལེན་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་བླང་བ་མེད་པའོ། །འདོར་བ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་དོར་བ་མེད་པའོ། །ལུས་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ངོ་བོ་ཉིད་མེད་པའོ། །རྣམ་པར་དག་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་རྣམ་པ་མེད་པའོ། །བྱེད་པ་པོ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ལས་མེད་པའོ། །འཕོ་བ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་རྣམ་པར་སྨིན་པ་མེད་པའོ། །ས་བོན་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་གདུང་བ་མེད་པའོ། །
en: “All phenomena are beyond conceptual signs because they are without limitations, wishless because they lack grasping, without conditioning because they are unconditioned, unconditioned because they completely transcend presence and absence, exceptional because they do not rely on anything external, without acceptance because they are without appropriation, without rejection because they are without abandonment, natureless because they are without bodies, lacking aspects because they are pure, actionless because they lack an agent, without maturation because they lack transmigration, and without anguish because of the absence of any seeds.

source: འཛིན་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་མཚན་མ་མེད་པའོ། །མདུད་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ལོག་པའི་ལས་མེད་པའོ། །རྣམ་པར་བསྒྲུབས་པ་མ་ཡིན་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་མདུད་པ་མེད་པའོ། །བྱས་པ་མ་ཡིན་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་རྣམ་པར་བསྒྲུབས་པ་མ་ཡིན་པའོ། །ཟག་པ་མི་སློང་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཟག་པ་མེད་པའོ། །གཟོད་མ་ནས་བྱུང་བ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་མ་བྱུང་བའོ། །གཉེན་པོ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་གསལ་བའོ། །རྣམ་པ་སྣ་ཚོགས་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་གཉེན་པོ་མེད་པའོ། །འབྱུང་བ་ཆེན་པོ་ལས་མ་བྱུང་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་གཟུགས་ཅན་མ་ཡིན་པའོ། །ཚོར་བ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཚོར་བ་མེད་པའོ། །འདུ་ཤེས་ཀྱི་ལམ་ལས་ཤིན་ཏུ་འདས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་འདུ་ཤེས་མེད་པའོ། །སྲེད་པ་དང་བྲལ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་འདུ་བྱེད་པ་མེད་པའོ། །སོ་སོར་རྣམ་པར་རིག་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་རྣམ་པར་ཤེས་པ་མེད་པའོ། །
en: “All phenomena are signless because of the absence of apprehending, without wrong acts because they are not bound, unbound because they are not established, unestablished because they are not created, uncontaminated because they are not subject to contamination, unoriginated because they are primordially without origin, clear because they lack remedies, lacking remedies because they lack differentiated aspects, without materiality because they do not originate from the great elements, lacking feeling because of the absence of feeling, lacking perception because they completely transcend the pathways of perception, lacking formations because they are free of craving, and lacking consciousness because of the absence of discriminating knowledge.

source: ཁམས་ནམ་མཁའ་དང་མཚུངས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཁམས་མེད་པའོ། །ཡུལ་གྱི་ལམ་ལས་ཤིན་ཏུ་འདས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་འདྲེན་པ་མེད་པའོ། །རྒྱུ་བ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཡུལ་མེད་པའོ། །ཀུན་བརྟགས་པ་མ་ཡིན་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་འདོད་པ་མེད་པའོ། །འཇུག་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་གཟུགས་མེད་པའོ། །ངེས་པར་སེམས་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་གཟུགས་མེད་པ་མ་ཡིན་པའོ། །འཁྲུགས་པ་སྤངས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་འཁྲུགས་པ་མེད་པའོ། །གཟུང་བ་མ་ཡིན་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་བསམ་གྱིས་མི་ཁྱབ་པའོ། །གཉིས་སུ་དབྱེར་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཡིད་མེད་པའོ། །ཡུལ་གྱི་ལམ་ལས་ཤིན་ཏུ་འདས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་གཟུང་བ་མ་ཡིན་པའོ། །རྟག་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཀུན་གཞི་མེད་པའོ། །རྟེན་པ་དང་མི་འཐུན་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཐེར་ཟུག་མ་ཡིན་པའོ། །མཚན་མ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་མིང་མེད་པའོ། །ཕན་ཚུན་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་འདྲེས་པ་མེད་པའོ། །གནས་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་གནས་པ་མེད་པའོ། །འགྱོད་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་རྗོད་པ་མེད་པའོ། །སྡིག་པ་དང་བྲལ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་འགྱོད་པ་མེད་པའོ། །དྲི་མ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་བག་ཆགས་མེད་པའོ། །གཟོད་མ་ནས་རྣམ་པར་དག་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་དྲི་མ་མེད་པའོ། །ཉོན་མོངས་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་གཟོད་མ་ནས་རྣམ་པར་དག་པའོ། །
en: “All phenomena lack elements because they are like the space element, without guidance because they completely transcend the path of objects, without objects because they are unmoving, without desire because they are not falsely imagined, without form because they are without engagement, not formless because they are not determined, not disordered because they are devoid of disorder, inconceivable because they cannot be apprehended, without mental activity because they are indivisible into duality, unapprehendable because they completely transcend the path of objects, without a substratum because they are impermanent, noneternal because they are not in disharmony with a support, nameless because they lack conceptual signs, unmixed because there is no relative continuity, without foundation because they are foundationless, inexpressible because they have nothing to regret, lacking regret because they are free of sin, without karmic traces because they are stainless, stainless because they are primordially pure, and primordially pure because of the absence of afflictive emotions.
